app/views/projects/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 1]]
---
    <h4>Tasks</h4>
    <% @project.tasks.each do |task| %>