app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Project 1"], ["description", "This is a testing project!"], ["user_id", 7], ["created_at", "2022-08-16 12:03:31.751816"], ["updated_at", "2022-08-16 12:03:31.751816"]]
---
  def create
    @project = current_user.projects.build(project_params)

    respond_to do |format|
      if @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT ?  [["user_id", 7], ["id", 1], ["LIMIT", 1]]
---
    def set_project
      @project = current_user.projects.find(params[:id])