app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "description", "status", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @task = @project.tasks.build(task_params)

    if @task.save

UPDATE "tasks" SET "description" = ?, "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Hi, I am Sachin"], ["status", "in-progress"], ["updated_at", "2022-08-16 16:17:28.701070"], ["id", 5]]
---
  def update
    if @task.update(task_params)

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT ?  [["user_id", 7], ["id", 1], ["LIMIT", 1]]
---
    def set_project
      @project = current_user.projects.find(params[:project_id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_task
      @task = @project.tasks.find(params[:id])